In [1]:
import pandas as pd

In [5]:
india_weather = pd.DataFrame({
    'city':['Mumbai','Banglore','Delhi'],
    'temprature':[32,53,55],
    'humidity':[45,67,34]
})

In [6]:
india_weather

       city  temprature  humidity
0    Mumbai          32        45
1  Banglore          53        67
2     Delhi          55        34

In [8]:
us_weather = pd.DataFrame({
    'city':['new york','chicago','orlando'],
    'temprature':[33,51,64],
    'humidity':[46,73,81]
})

In [9]:
us_weather

       city  temprature  humidity
0  new york          33        46
1   chicago          51        73
2   orlando          64        81

In [10]:
df = pd.concat([india_weather,us_weather])

In [11]:
df

       city  temprature  humidity
0    Mumbai          32        45
1  Banglore          53        67
2     Delhi          55        34
0  new york          33        46
1   chicago          51        73
2   orlando          64        81

In [13]:
df = pd.concat([india_weather,us_weather],ignore_index=True)

In [14]:
df

       city  temprature  humidity
0    Mumbai          32        45
1  Banglore          53        67
2     Delhi          55        34
3  new york          33        46
4   chicago          51        73
5   orlando          64        81

In [15]:
# It create an additonal subset index which identifies that which data belongs to which country

df = pd.concat([india_weather,us_weather],keys=['india','us'])

df

             city  temprature  humidity
india 0    Mumbai          32        45
      1  Banglore          53        67
      2     Delhi          55        34
us    0  new york          33        46
      1   chicago          51        73
      2   orlando          64        81

In [17]:
# LOC stands for location 
df.loc['india']

       city  temprature  humidity
0    Mumbai          32        45
1  Banglore          53        67
2     Delhi          55        34

In [28]:
temperature_df = pd.DataFrame({
    'city':['Mumbai','Banglore','Delhi'],
    'temprature':[32,53,55]
},index=[0,1,2])

In [29]:
windspeed_df = pd.DataFrame({
    'city':['Delhi','mumbai'],
    'windspeed':[42,52],
},index=[2,0])

In [30]:
df = pd.concat([temperature_df,windspeed_df])

In [32]:
df

       city  temprature  windspeed
0    Mumbai        32.0        NaN
1  Banglore        53.0        NaN
2     Delhi        55.0        NaN
2     Delhi         NaN       42.0
0    mumbai         NaN       52.0

But we want to append this dataframe in column wise

In [33]:
df = pd.concat([temperature_df,windspeed_df],axis=1)

In [34]:
df

       city  temprature    city  windspeed
0    Mumbai          32  mumbai       52.0
1  Banglore          53     NaN        NaN
2     Delhi          55   Delhi       42.0

#now in case the data went missing and not in order.
that in case of temperature data banglore is missing.
See the above example

In [36]:
# Add a series(a column to the existing dataframe)
s = pd.Series(['humid','rainy','dry'],name='event')

In [37]:
df = pd.concat([temperature_df,s],axis=1)

In [38]:
df

       city  temprature  event
0    Mumbai          32  humid
1  Banglore          53  rainy
2     Delhi          55    dry